================================================================================
FAT TESTING - RESULTADOS DE PRUEBAS
================================================================================

Usuario: bastian
Fecha: 2025-11-12 17:57:40
Dispositivo: Cisco 9200
Modo: Simulación

================================================================================


================================================================================
# INICIO PRUEBA 1
================================================================================
Nombre: Verificación de Versión
Comando: show version
Timestamp: 2025-11-12 17:57:33

Salida:
--------------------------------------------------------------------------------

Cisco 9200 Switch
Cisco IOS Software, Cisco 9200 Software (CAT9K_IOSXE), Version 17.9.3
Copyright (c) 1986-2023 by Cisco Systems, Inc.
Compiled Wed 26-Apr-23 00:00 by prod_rel_team

System image file is "flash:packages.conf"
Last reload reason: Reload Command

Cisco 9200 uptime is 2 weeks, 3 days, 5 hours, 12 minutes
System returned to ROM by reload
System image file is "bootflash:packages.conf"

Processor board ID FCW2345G0XY
1 Virtual Ethernet interface
56 Gigabit Ethernet interfaces
2048K bytes of non-volatile configuration memory.
16777216K bytes of physical memory.
1638400K bytes of Crash Files at crashinfo:.
11264000K bytes of Flash at flash:.

Configuration register is 0x102

--------------------------------------------------------------------------------
# FIN PRUEBA 1
================================================================================


================================================================================
# INICIO PRUEBA 2
================================================================================
Nombre: Inventario Básico
Comando: show inventory
Timestamp: 2025-11-12 17:57:33

Salida:
--------------------------------------------------------------------------------

NAME: "Cisco 9200 48-Port Switch", DESCR: "Cisco 9200 48-Port Switch"
PID: C9300-48P         , VID: V01  , SN: FCW2345G0XY

NAME: "StackPort1/1", DESCR: "StackPort1/1"
PID: STACK-T1-50CM     , VID: V01  , SN: LCC2346A1BC

NAME: "Power Supply Module 1", DESCR: "800W AC Config 1 Power Supply"
PID: PWR-C1-840WA      , VID: V01  , SN: ART2345P0CD

NAME: "Power Supply Module 2", DESCR: "800W AC Config 1 Power Supply"
PID: PWR-C1-840WA      , VID: V01  , SN: ART2345P0CE

NAME: "Fan Tray 1", DESCR: "Fan Tray 1"
PID: C9300-FAN-F       , VID: V01  , SN: N/A

--------------------------------------------------------------------------------
# FIN PRUEBA 2
================================================================================


================================================================================
# INICIO PRUEBA 3
================================================================================
Nombre: Estado de Fuentes de Poder
Comando: show environment power
Timestamp: 2025-11-12 17:57:34

Salida:
--------------------------------------------------------------------------------

Power                                             Fan
Supply  Model No                Type              Status
------  ----------------------  ----------------  ------
PS1     PWR-C1-840WA            AC 800W           OK
PS2     PWR-C1-840WA            AC 800W           OK

PS1  800W ( 41 W allocated, 759 W available, 0 W inline power allocated)
PS2  800W ( 41 W allocated, 759 W available, 0 W inline power allocated)

--------------------------------------------------------------------------------
# FIN PRUEBA 3
================================================================================


================================================================================
# INICIO PRUEBA 4
================================================================================
Nombre: Estado de Ventiladores
Comando: show environment fan
Timestamp: 2025-11-12 17:57:34

Salida:
--------------------------------------------------------------------------------

Fan  Status
----  ------
FAN1  OK
FAN2  OK
FAN3  OK

--------------------------------------------------------------------------------
# FIN PRUEBA 4
================================================================================


================================================================================
# INICIO PRUEBA 5
================================================================================
Nombre: Prueba de Reload
Comando: reload
Timestamp: 2025-11-12 17:57:35

Salida:
--------------------------------------------------------------------------------
[SIMULADOR] Dispositivo reiniciándose... (simulado)
--------------------------------------------------------------------------------
# FIN PRUEBA 5
================================================================================


================================================================================
# INICIO PRUEBA 6
================================================================================
Nombre: Modo Enable
Comando: enable
Timestamp: 2025-11-12 17:57:36

Salida:
--------------------------------------------------------------------------------
Cisco 9200#
--------------------------------------------------------------------------------
# FIN PRUEBA 6
================================================================================


================================================================================
# INICIO PRUEBA 7
================================================================================
Nombre: Inventario Completo
Comando: show inventory all
Timestamp: 2025-11-12 17:57:37

Salida:
--------------------------------------------------------------------------------

NAME: "Cisco 9200 48-Port Switch", DESCR: "Cisco 9200 48-Port Switch"
PID: C9300-48P         , VID: V01  , SN: FCW2345G0XY

NAME: "StackPort1/1", DESCR: "StackPort1/1"
PID: STACK-T1-50CM     , VID: V01  , SN: LCC2346A1BC

NAME: "Power Supply Module 1", DESCR: "800W AC Config 1 Power Supply"
PID: PWR-C1-840WA      , VID: V01  , SN: ART2345P0CD

NAME: "Power Supply Module 2", DESCR: "800W AC Config 1 Power Supply"
PID: PWR-C1-840WA      , VID: V01  , SN: ART2345P0CE

NAME: "Fan Tray 1", DESCR: "Fan Tray 1"
PID: C9300-FAN-F       , VID: V01  , SN: N/A

--------------------------------------------------------------------------------
# FIN PRUEBA 7
================================================================================


================================================================================
# INICIO PRUEBA 8
================================================================================
Nombre: Interfaces Ethernet
Comando: show interface ethernet
Timestamp: 2025-11-12 17:57:37

Salida:
--------------------------------------------------------------------------------

GigabitEthernet1/0/1 is up, line protocol is up (connected)
  Hardware is Gigabit Ethernet, address is 70b3.17ff.6480 (bia 70b3.17ff.6480)
  MTU 1500 bytes, BW 1000000 Kbit/sec, DLY 10 usec

GigabitEthernet1/0/2 is down, line protocol is down (notconnect)
  Hardware is Gigabit Ethernet, address is 70b3.17ff.6481 (bia 70b3.17ff.6481)
  MTU 1500 bytes, BW 1000000 Kbit/sec, DLY 10 usec

--------------------------------------------------------------------------------
# FIN PRUEBA 8
================================================================================

